<template>
  <div
    id="welcome"
    class="welcome"
    v-loading="loading"
    element-loading-text="拼命加载中"
    element-loading-spinner="el-icon-loading"
    element-loading-background="rgba(0, 0, 0, 0.8)"
  >
    <iframe src="/#/view" frameborder="0"></iframe>
    <!-- <el-card>
      <ve-line :data="chartData1" :data-zoom="dataZoom"></ve-line>
    </el-card>
    <el-card>
      <ve-histogram :data="chartData2"></ve-histogram>
    </el-card>
    <div class="line">
      <el-card>
        <ve-gauge :data="chartData3" :settings="chartSettings"></ve-gauge>
      </el-card>
      <el-card>
        <ve-pie :data="chartData4"></ve-pie>
      </el-card>
    </div>
    <div class="bottom"></div>-->
  </div>
</template>

<script>
export default {
  name: 'welcome',
  data() {
    return {
      loading: false,
      chartData1: {
        columns: ['星期', '模块一', '模块二', '模块三', '模块四', '模块五'],
        rows: [
          {
            星期: '1月1日',
            模块一: 6,
            模块二: 4,
            模块三: 7,
            模块四: 21,
            模块五: 20
          },
          {
            星期: '1月2日',
            模块一: 25,
            模块二: 12,
            模块三: 9,
            模块四: 2,
            模块五: 17
          },
          {
            星期: '1月3日',
            模块一: 25,
            模块二: 28,
            模块三: 1,
            模块四: 23,
            模块五: 20
          },
          {
            星期: '1月4日',
            模块一: 9,
            模块二: 22,
            模块三: 6,
            模块四: 2,
            模块五: 15
          },
          {
            星期: '1月5日',
            模块一: 12,
            模块二: 13,
            模块三: 5,
            模块四: 26,
            模块五: 27
          },
          {
            星期: '1月6日',
            模块一: 4,
            模块二: 23,
            模块三: 9,
            模块四: 24,
            模块五: 22
          },
          {
            星期: '1月7日',
            模块一: 0,
            模块二: 13,
            模块三: 25,
            模块四: 29,
            模块五: 4
          },
          {
            星期: '1月8日',
            模块一: 23,
            模块二: 9,
            模块三: 12,
            模块四: 14,
            模块五: 24
          },
          {
            星期: '1月9日',
            模块一: 2,
            模块二: 4,
            模块三: 23,
            模块四: 18,
            模块五: 20
          },
          {
            星期: '1月10日',
            模块一: 8,
            模块二: 13,
            模块三: 2,
            模块四: 25,
            模块五: 7
          },
          {
            星期: '1月11日',
            模块一: 15,
            模块二: 28,
            模块三: 1,
            模块四: 6,
            模块五: 27
          },
          {
            星期: '1月12日',
            模块一: 24,
            模块二: 15,
            模块三: 5,
            模块四: 20,
            模块五: 27
          },
          {
            星期: '1月13日',
            模块一: 20,
            模块二: 0,
            模块三: 29,
            模块四: 6,
            模块五: 7
          },
          {
            星期: '1月14日',
            模块一: 4,
            模块二: 28,
            模块三: 28,
            模块四: 19,
            模块五: 10
          },
          {
            星期: '1月15日',
            模块一: 14,
            模块二: 11,
            模块三: 13,
            模块四: 6,
            模块五: 14
          },
          {
            星期: '1月16日',
            模块一: 25,
            模块二: 12,
            模块三: 6,
            模块四: 27,
            模块五: 9
          },
          {
            星期: '1月17日',
            模块一: 26,
            模块二: 19,
            模块三: 4,
            模块四: 6,
            模块五: 15
          },
          {
            星期: '1月18日',
            模块一: 6,
            模块二: 17,
            模块三: 6,
            模块四: 26,
            模块五: 10
          },
          {
            星期: '1月19日',
            模块一: 2,
            模块二: 22,
            模块三: 10,
            模块四: 14,
            模块五: 26
          },
          {
            星期: '1月20日',
            模块一: 18,
            模块二: 17,
            模块三: 6,
            模块四: 20,
            模块五: 5
          },
          {
            星期: '1月21日',
            模块一: 26,
            模块二: 23,
            模块三: 0,
            模块四: 13,
            模块五: 6
          },
          {
            星期: '1月22日',
            模块一: 2,
            模块二: 6,
            模块三: 22,
            模块四: 12,
            模块五: 2
          },
          {
            星期: '1月23日',
            模块一: 15,
            模块二: 28,
            模块三: 29,
            模块四: 14,
            模块五: 19
          },
          {
            星期: '1月24日',
            模块一: 15,
            模块二: 5,
            模块三: 10,
            模块四: 13,
            模块五: 24
          },
          {
            星期: '1月25日',
            模块一: 20,
            模块二: 17,
            模块三: 12,
            模块四: 0,
            模块五: 25
          },
          {
            星期: '1月26日',
            模块一: 17,
            模块二: 20,
            模块三: 3,
            模块四: 2,
            模块五: 8
          },
          {
            星期: '1月27日',
            模块一: 7,
            模块二: 22,
            模块三: 22,
            模块四: 1,
            模块五: 28
          },
          {
            星期: '1月28日',
            模块一: 24,
            模块二: 5,
            模块三: 8,
            模块四: 18,
            模块五: 14
          },
          {
            星期: '1月29日',
            模块一: 23,
            模块二: 20,
            模块三: 29,
            模块四: 24,
            模块五: 21
          },
          {
            星期: '1月30日',
            模块一: 17,
            模块二: 8,
            模块三: 27,
            模块四: 26,
            模块五: 4
          },
          {
            星期: '1月31日',
            模块一: 20,
            模块二: 18,
            模块三: 26,
            模块四: 23,
            模块五: 28
          }
        ]
      },
      dataZoom: [
        {
          type: 'slider',
          start: 0,
          end: 100
        }
      ],
      chartData2: {
        columns: ['星期', '模块一', '模块二', '模块三', '模块四', '模块五'],
        rows: [
          {
            星期: '星期一',
            模块一: 1393,
            模块二: 1093,
            模块三: 2623,
            模块四: 1423,
            模块五: 4593
          },
          {
            星期: '星期二',
            模块一: 3530,
            模块二: 3230,
            模块三: 1423,
            模块四: 1723,
            模块五: 3792
          },
          {
            星期: '星期三',
            模块一: 2923,
            模块二: 2623,
            模块三: 1093,
            模块四: 2623,
            模块五: 2623
          },
          {
            星期: '星期四',
            模块一: 1723,
            模块二: 1423,
            模块三: 2923,
            模块四: 1393,
            模块五: 1423
          },
          {
            星期: '星期五',
            模块一: 3792,
            模块二: 3492,
            模块三: 1393,
            模块四: 3792,
            模块五: 2623
          },
          {
            星期: '星期六',
            模块一: 4593,
            模块二: 4293,
            模块三: 1723,
            模块四: 3230,
            模块五: 1723
          },
          {
            星期: '星期日',
            模块一: 3492,
            模块二: 2923,
            模块三: 1423,
            模块四: 2623,
            模块五: 1393
          }
        ]
      },
      chartSettings: {
        dataType: {
          占比: 'percent'
        },
        seriesMap: {
          占比: {
            min: 0,
            max: 1
          }
        }
      },
      chartData3: {
        columns: ['type', 'value'],
        rows: [{ type: '占比', value: 0.21 }]
      },
      chartData4: {
        columns: ['星期', '访问用户'],
        rows: [
          { 星期: '星期一', 访问用户: 1393 },
          { 星期: '星期二', 访问用户: 3530 },
          { 星期: '星期三', 访问用户: 2923 },
          { 星期: '星期四', 访问用户: 1723 },
          { 星期: '星期五', 访问用户: 3792 },
          { 星期: '星期六', 访问用户: 4593 },
          { 星期: '星期日', 访问用户: 2923 }
        ]
      }
    }
  },
  created() {
    this.loading = true
  },
  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 800)
  }
}
</script>

<style lang="scss" scoped>
#welcome {
  width: 100%;
  height: 100%;
  padding: 10px;
  iframe {
    width: 100%;
    height: 100%;
  }
  // padding: 30px;
  .line {
    margin: 30px 0;
    display: flex;
    .el-card {
      flex: 0.5;
    }
  }
  .bottom {
    height: 120px;
  }
}
</style>
